mtosi1.1-TestSuite/TestsDefinitions/InventoryRetrieval/examples/InventoryRetrieval_getInventory4_sit_2.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns="tmf854.v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="tmf854.v1 ../../../../xsd/common/Header.xsd tmf854.v1 ../../../../xsd/interfaces/InventoryRetrieval.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<header tmf854Version="1.1">
			<activityName>getInventory</activityName>
			<msgName>getInventoryIterator</msgName>
			<msgType>REQUEST</msgType>
			<senderURI>/MTOSI/InventoryOS</senderURI>
			<destinationURI>/MTOSI/EMS01</destinationURI>
			<communicationPattern>MultipleBatchResponse</communicationPattern>
			<communicationStyle>RPC</communicationStyle>
			<requestedBatchSize>2</requestedBatchSize>
			<iteratorReferenceURI>12345</iteratorReferenceURI>
			<timestamp>20051004140305</timestamp>
		</header>
	</soap:Header>
	<soap:Body>
		<getInventoryIterator tmf854Version="1.1"/>
	</soap:Body>
</soap:Envelope>
